{
  "context": {
    "introduction": "Welcome to the fundamentals of Japanese cuisine! In this lesson, you'll learn about the essential pillars that define Japanese gastronomy: umami, basic ingredients, and the most important preparation techniques.",
    "sections": [
      {
        "title": "Umami: The Fifth Taste",
        "icon": "Sparkles",
        "content": "Umami is the most important flavor component in Japanese cuisine. Discovered by Japanese scientist Kikunae Ikeda in 1908, this 'fifth taste' is characterized by being savory, deep, and satisfying. It's found naturally in ingredients like kombu, katsuobushi (dried bonito), and shiitake mushrooms."
      },
      {
        "title": "Dashi: The Foundation of Everything",
        "icon": "Layers",
        "content": "Dashi is the fundamental broth that gives life to Japanese cuisine. It's prepared mainly with kombu (seaweed) and katsuobushi. Kombu provides minerals and a deep umami, while katsuobushi adds smoky notes. This broth is the base for soups, sauces, and many traditional dishes."
      },
      {
        "title": "Sushi Rice Preparation",
        "icon": "Target",
        "content": "Sushi rice (shari) requires special preparation. After cooking short-grain Japanese rice, it's carefully mixed with rice vinegar (su), sugar, and salt while hot. This mixture must cool to body temperature to achieve the perfect texture."
      },
      {
        "title": "Tempura: The Art of Deep Frying",
        "icon": "BookOpen",
        "listItems": [
          "Tempura is cooked by deep frying in oil at 170-180°C (340-355°F)",
          "The batter must be cold and lightly mixed to achieve crispy texture",
          "Use ice water and low-gluten flour",
          "Ingredients must be dry before battering",
          "Cooking time is crucial: just a few minutes to keep ingredients tender"
        ]
      },
      {
        "title": "Tips for Success",
        "icon": "LightbulbIcon",
        "listItems": [
          "Umami is enhanced by combining different sources like kombu and mushrooms",
          "Never boil kombu, just soak it in warm water",
          "Rice vinegar should be mixed when the rice is hot",
          "For perfect tempura, keep the batter cold and oil at constant temperature"
        ]
      }
    ]
  }
} 