{
  "context": {
    "introduction": "¡Bienvenido a los fundamentos de la cocina japonesa! En esta lección aprenderás sobre los pilares esenciales que definen la gastronomía japonesa: el umami, los ingredientes básicos y las técnicas de preparación más importantes.",
    "sections": [
      {
        "title": "El Umami: El Quinto Sabor",
        "icon": "Sparkles",
        "content": "El umami es el componente de sabor más importante en la cocina japonesa. Descubierto por el científico japonés Kikunae Ikeda en 1908, este 'quinto sabor' se caracteriza por ser sabroso, profundo y satisfactorio. Se encuentra naturalmente en ingredientes como kombu, katsuobushi (bonito seco) y shiitake."
      },
      {
        "title": "Dashi: La Base de Todo",
        "icon": "Layers",
        "content": "El dashi es el caldo fundamental que da vida a la cocina japonesa. Se prepara principalmente con kombu (alga marina) y katsuobushi. El kombu aporta minerales y un umami profundo, mientras que el katsuobushi añade notas ahumadas. Este caldo es la base de sopas, salsas y muchos platos tradicionales."
      },
      {
        "title": "Preparación del Arroz para Sushi",
        "icon": "Target",
        "content": "El arroz de sushi (shari) requiere una preparación especial. Después de cocinar el arroz japonés de grano corto, se mezcla cuidadosamente con vinagre de arroz (su), azúcar y sal mientras está caliente. Esta mezcla debe enfriarse a temperatura corporal para lograr la textura perfecta."
      },
      {
        "title": "Tempura: El Arte de la Fritura",
        "icon": "BookOpen",
        "listItems": [
          "La tempura se cocina por fritura profunda en aceite a 170-180°C",
          "La masa debe estar fría y poco mezclada para lograr textura crujiente",
          "Se usa agua helada y harina de bajo gluten",
          "Los ingredientes deben estar secos antes de rebozar",
          "El tiempo de cocción es crucial: pocos minutos para mantener los ingredientes tiernos"
        ]
      },
      {
        "title": "Consejos para el Éxito",
        "icon": "LightbulbIcon",
        "listItems": [
          "El umami se potencia combinando diferentes fuentes como kombu y hongos",
          "Nunca hiervas el kombu, solo remójalo en agua tibia",
          "El vinagre de arroz debe mezclarse cuando el arroz está caliente",
          "Para tempura perfecta, mantén la masa fría y el aceite a temperatura constante"
        ]
      }
    ]
  }
} 