{
  "context": {
    "introduction": "안녕하세요! (Annyeonghaseyo!) Welcome to the fundamentals of Korean cuisine. In this lesson, you'll discover the essential ingredients, fermentation techniques, and cooking methods that make this fascinating gastronomy unique.",
    "sections": [
      {
        "title": "Kimchi: The Fermented Treasure",
        "icon": "Sparkles",
        "content": "Kimchi is Korea's most emblematic fermented vegetable, traditionally made with napa cabbage. This superfood is fermented with salt, gochugaru (chili powder), garlic, ginger, and other seasonings. Rich in probiotics, it serves both as a side dish and as a base ingredient for many dishes."
      },
      {
        "title": "Gochujang: The Soul Paste",
        "icon": "BookOpen",
        "content": "Gochujang is a fermented paste made from red chiles, glutinous rice, fermented soybeans, and salt. Its flavor is complex: spicy, sweet, salty, and umami all at once. It's indispensable in dishes like bibimbap, tteokbokki, and meat marinades."
      },
      {
        "title": "Short-Grain Rice: The Perfect Base",
        "icon": "Target",
        "content": "Traditional Korean rice is short-grain, stickier than long-grain rice. It's typically cooked in a rice cooker or traditional clay pot (dolsot). Its texture allows a golden crust to form at the bottom, highly prized in Korean cuisine."
      },
      {
        "title": "Korean BBQ: The Art of Grilling",
        "icon": "Layers",
        "listItems": [
          "Gas or charcoal grills with metal grates are used",
          "Meats are marinated beforehand with ingredients like soy sauce, pear, and garlic",
          "Meat is cut into small pieces for quick and even cooking",
          "It's accompanied by banchan (small side dishes)",
          "Each diner cooks their own portion at the table"
        ]
      },
      {
        "title": "Essential Techniques",
        "icon": "LightbulbIcon",
        "listItems": [
          "Kimchi improves with time: minimum 3 days of fermentation",
          "Gochujang can be diluted with sesame oil for sauces",
          "Rice is washed until the water runs clear before cooking",
          "For Korean BBQ, preheat the grill well before cooking",
          "Korean flavors balance sweet, salty, spicy, and sour"
        ]
      }
    ]
  }
} 