{
  "context": {
    "introduction": "Welcome to intermediate Japanese cooking! In this lesson, you'll master essential cooking methods, traditional equipment, and knife techniques that form the backbone of Japanese culinary artistry.",
    "sections": [
      {
        "title": "Donabe: The Clay Cooking Vessel",
        "icon": "Sparkles",
        "content": "The donabe is a traditional Japanese clay pot that has been used for centuries. Its porous clay material retains heat evenly and imparts a subtle earthy flavor to food. Perfect for making rice, stews, and hot pots, the donabe creates gentle, uniform cooking that preserves the natural flavors of ingredients."
      },
      {
        "title": "Knife Skills: Julienne Cutting",
        "icon": "Target",
        "content": "Julienne is a fundamental cutting technique creating thin, matchstick-like strips (1-2mm thick, 4-5cm long). This precise cut ensures even cooking and elegant presentation. Used for vegetables in dishes like kinpira gobo and garnishes for sashimi platters."
      },
      {
        "title": "Miso Soup Tradition",
        "icon": "Layers",
        "content": "Miso soup is traditionally served in wooden bowls (owan) that enhance the dining experience. The wooden material doesn't conduct heat, making it comfortable to hold, while the natural wood grain adds visual warmth. The bowls are often lacquered for durability and beauty."
      },
      {
        "title": "Yakitori: The Art of Grilling",
        "icon": "BookOpen",
        "listItems": [
          "Yakitori uses binchōtan charcoal for consistent, high heat",
          "Skewers are typically made from bamboo or metal tare",
          "Tare (sweet soy-based sauce) is applied in layers during cooking",
          "Different cuts include momo (thigh), tsukune (meatballs), and negima (with leek)",
          "The grill master (yakitori-ya) requires years of training to perfect timing"
        ]
      },
      {
        "title": "Intermediate Techniques",
        "icon": "LightbulbIcon",
        "listItems": [
          "Season your donabe gradually with rice porridge before first use",
          "Keep knives at 15-degree angle for precise julienne cuts",
          "Wooden bowls should be warmed with hot water before serving miso soup",
          "Yakitori requires constant attention - rotate skewers every 30-45 seconds"
        ]
      }
    ]
  }
} 